###  Part # 1
  #### Terragrunt Format and Style 🖌`success`
  #### Terragrunt Initialization ⚙️`success`
  #### Terragrunt Validation 🤖`success`

  <details><summary>Validation Output</summary>

  ```
  Success! The configuration is valid.


  ```

  </details>

  #### Terragrunt Plan 📖`success`
  <details><summary>Show Plan</summary>

  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.route53_zone["kolv.in-public"] will be created
  + resource "aws_route53_zone" "route53_zone" {
      + arn                 = (known after apply)
      + comment             = "kolv.in public zone"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "kolv.in"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hosted_zones = {
      + "kolv.in-public" = {
          + arn                 = (known after apply)
          + comment             = "kolv.in public zone"
          + delegation_set_id   = null
          + force_destroy       = false
          + id                  = (known after apply)
          + name                = "kolv.in"
          + name_servers        = (known after apply)
          + primary_name_server = (known after apply)
          + tags                = null
          + tags_all            = (known after apply)
          + vpc                 = []
          + zone_id             = (known after apply)
        }
    }

  ```

  </details>

  *Pusher: @kolvin, Action: `pull_request`, Working Directory: `route53/prod/global`, Workflow: `route53-prod-eu-west-1`*